Revit 2027 API
StructuralSectionStructuralTees.BoltSpacing Property
 Standard bolt spacing in the flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltSpacing { get; set; }
Public Property BoltSpacing As Double
	Get
	Set
public:
property double BoltSpacing {
	double get ();
	void set (double value);
}
member BoltSpacing : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace